toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static void EndpointReset(uint8_t ep) {
        Toastbox::IntState ints(false);
        _EndpointReset(ep);
        
        T_Scheduler::Ctx(ep);
        T_Scheduler::Wait([] { return _EndpointReady(T_Scheduler::template Ctx<uint8_t>()); });
    }
    
    static void EndpointsReset() {
        Toastbox::IntState ints(false);
        for (uint8_t ep : T_Config::Endpoints) {
            _EndpointReset(ep);
        }
        T_Scheduler::Wait([] { return _EndpointsReady(); });
    }
    
    template <typename T>
    static void CmdRecv(T& cmd) {
        for (;;) {
            // Wait until we're in the Connecting state
            {
                Toastbox::IntState ints(false);
                T_Scheduler::Wait([] { return _State == State::Connecting || _State == State::Connected; });
                if (_State == State::Connecting) {
                    // Update our state
                    _State = State::Connected;
                    _CmdRecvLen = std::nullopt;
                }
            }
            
            // Wait for a command
            for (;;) {
                // Disable interrupts
                Toastbox::IntState ints(false);
                
                // Wait for a new command to arrive, or for our state to change
                T_Scheduler::Wait([] { return _CmdRecvLen || _State!=State::Connected; });
                
                // If we're no longer connected, bail and wait to be connected again
                if (_State != State::Connected) break;
                
                // Consume the command
                const size_t len = *_CmdRecvLen;
                _CmdRecvLen = std::nullopt;
                
                // Reject command if the length isn't valid
                if (len != sizeof(T)) {
                    _CmdAccept(false);
                    continue;
                }
                
                // Return command to caller
                memcpy(&cmd, _CmdRecvBuf, len);
                return;
            }
        }
    }
    
    static void CmdAccept(bool accept) {
        Toastbox::IntState ints(false);
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return;
        _CmdAccept(accept);
    }
    
    static std::optional<size_t> Recv(uint8_t ep, void* data, size_t len) {
        Assert(EndpointOut(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        
        uint8_t* dst = (uint8_t*)data;
        size_t recv = 0;
        size_t rem = len;
        while (rem) {
            Assert(_Ready(eps));
            _AdvanceStateOut(ep);
            
            const size_t chunkLen = std::min(_TransferSizeMax(), rem);
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, dst, chunkLen);
            Assert(us == USBD_OK);
            
            _WaitState ws = { .ep = ep };
            T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
            T_Scheduler::Wait([] { return _WaitRecv(*T_Scheduler::template Ctx<_WaitState*>()); });
            if (!ws.ok) return std::nullopt;
            
            dst += ws.len;
            recv += ws.len;
            rem -= ws.len;
            if (ws.len < chunkLen) break;
        }
        
        return recv;
    }
    
    static bool Send(uint8_t ep, const void* data, size_t len) {
        Assert(EndpointIn(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return false; // Short-circuit if we're not Connected
        
        const uint8_t* src = (uint8_t*)data;
        size_t sent = 0;
        size_t rem = len;
        while (rem) {
            Assert(_Ready(eps));
            _AdvanceStateIn(ep);
            
            const size_t chunkLen = std::min(_TransferSizeMax(), rem);
            const USBD_StatusTypeDef us = USBD_LL_Transmit(&_Device, ep, src, chunkLen);
            Assert(us == USBD_OK);
            
            _WaitState ws = { .ep = ep };
            T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
            T_Scheduler::Wait([] { return _WaitSend(*T_Scheduler::template Ctx<_WaitState*>()); });
            
            src += ws.len;
            sent += ws.len;
            rem -= ws.len;
            if (ws.len < chunkLen) break;
        }
        
        return sent;
    }
    
    static void ISR() {
        ISR_HAL_PCD(&_PCD);
    }
    
    // _TransferSizeMax(): returns the maximum bytes that can be transfered without
    // overflowing the hardware's PKTCNT register.
    // If we're sending or receiving more than this amount of data, we need to
    // perform the operation in chunks.
    static constexpr size_t _TransferSizeMax() {
        // Verify that the IN-packet-count is the same as the OUT-packet-count,
        // since we're only defining one function that returns the
        // max-transfer-size for both IN- and OUT- transfers.
        static_assert(USB_OTG_DIEPTSIZ_PKTCNT == USB_OTG_DOEPTSIZ_PKTCNT);
        constexpr size_t PacketCountMax = USB_OTG_DIEPTSIZ_PKTCNT>>USB_OTG_DIEPTSIZ_PKTCNT_Pos;
        return PacketCountMax*T_Config::MaxPacketSize();
    }
    
    static uint8_t _USBD_Init(uint8_t cfgidx) {
        // Open endpoints
        for (uint8_t ep : T_Config::Endpoints) {
            USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, T_Config::MaxPacketSize());
            
            if (EndpointOut(ep)) {
                _Device.ep_out[EndpointIdx(ep)].is_used = 1U;
            } else {
                _Device.ep_in[EndpointIdx(ep)].is_used = 1U;
            }
            
            // Reset endpoint state
            _EndpointStateGet(ep) = {};
        }
        
        _State = State::Connecting;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DeInit(uint8_t cfgidx) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Suspend() {
        _State = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Resume() {
        _State = State::Connected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Setup(USBD_SetupReqTypedef* req) {
        switch (req->bmRequest & USB_REQ_TYPE_MASK) {
        case USB_REQ_TYPE_VENDOR:
            USBD_CtlPrepareRx(&_Device, _CmdRecvBuf, sizeof(_CmdRecvBuf));
            return USBD_OK;
        
        default:
            USBD_CtlError(&_Device, req);
            return USBD_FAIL;
        }
    }
    
    static uint8_t _USBD_EP0_TxSent() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_EP0_RxReady() {
        const size_t recvLen = USBD_LL_GetRxDataSize(&_Device, 0);
        if (!_CmdRecvLen) {
            _CmdRecvLen = recvLen;
        } else {
            // If a command is already underway, respond to the request with an error
            USBD_CtlError(&_Device, nullptr);
        }
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataIn(uint8_t epidx) {
        const uint8_t ep = Toastbox::USB::Endpoint::DirectionIn | epidx;
        // Sanity-check the endpoint state
        _EndpointState& eps = _EndpointStateGet(ep);
        Assert(
            eps.stage == _EndpointStage::ResetZLP1     ||
            eps.stage == _EndpointStage::ResetZLP2     ||
            eps.stage == _EndpointStage::ResetSentinel ||
            eps.stage == _EndpointStage::Busy
        );
        _AdvanceStateIn(ep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataOut(uint8_t epidx) {
        const uint8_t ep = Toastbox::USB::Endpoint::DirectionOut | epidx;
        _EndpointState& eps = _EndpointStateGet(ep);
        // Sanity-check the endpoint state
        Assert(
            eps.stage == _EndpointStage::ResetZLP1     ||
            eps.stage == _EndpointStage::ResetZLP2     ||
            eps.stage == _EndpointStage::ResetSentinel ||
            eps.stage == _EndpointStage::Busy
        );
        _AdvanceStateOut(ep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_SOF() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoINIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoOUTIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static const uint8_t* _USBD_GetConfigDescriptor(uint16_t* len) {
        *len = sizeof(*T_Config::Descriptor());
        return (const uint8_t*)T_Config::Descriptor();
    }
    
    static const uint8_t* _USBD_GetUsrStrDescriptor(uint8_t index, uint16_t* len) {
        return nullptr;
    }
    
    // Ints must be disabled
    static void _CmdAccept(bool accept) {
        if (accept) USBD_CtlSendStatus(&_Device);
        else        USBD_CtlError(&_Device, nullptr);
    }
    
    struct _WaitState {
        const uint8_t ep = 0;
        bool ok = false;
        size_t len = 0;
    };
    
    static bool _WaitRecv(_WaitState& ws) {
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return true; // Done, failed
        
        const _EndpointState& eps = _EndpointStateGet(ws.ep);
        switch (eps.stage) {
        // Still waiting for completion
        case _EndpointStage::Busy:
            return false;
        // Done, success
        case _EndpointStage::Done:
            ws.ok = true;
            ws.len = eps.len;
            _AdvanceStateOut(ws.ep);
            return true;
        // Done, failed
        default:
            return true;
        }
    }
    
    static bool _WaitSend(_WaitState& ws) {
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return true; // Done, failed
        
        const _EndpointState& eps = _EndpointStateGet(ws.ep);
        switch (eps.stage) {
        // Still waiting for completion
        case _EndpointStage::Busy:
            return false;
        // Done, success
        case _EndpointStage::Done:
            ws.ok = true;
            _AdvanceStateIn(ws.ep);
            return true;
        // Done, failed
        default:
            return true;
        }
    }
    
    // Ints must be disabled
    static void _EndpointReset(uint8_t ep) {
        if (_State != State::Connected) return; // Short-circuit if we're not Connected
        _EndpointState& eps = _EndpointStateGet(ep);
        eps.needsReset = true;
        if (_Ready(eps)) {
            if (EndpointOut(ep)) {
                _AdvanceStateOut(ep);
            } else {
                _AdvanceStateIn(ep);
            }
        }
    }
    
    // Ints must be disabled
    static bool _EndpointReady(uint8_t ep) {
        return _Ready(_EndpointStateGet(ep));
    }
    
    // Ints must be disabled
    static bool _EndpointsReady() {
        for (uint8_t ep : T_Config::Endpoints) {
            if (!_EndpointReady(ep)) return false;
        }
        return true;
    }
    
    // Ints must be disabled
    static bool _Ready(const _EndpointState& eps) {
        return eps.stage==_EndpointStage::Ready;
    }
    
    // Ints must be disabled
    static void _AdvanceStateOut(uint8_t ep) {
        _EndpointState& eps = _EndpointStateGet(ep);
        if (eps.needsReset) {
            eps.stage = _EndpointStage::Reset;
            eps.needsReset = false;
        }
        
        eps.len = USBD_LL_GetRxDataSize(&_Device, ep);
        
